# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [24]:
#Your code here
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [19]:
#Your code here
cur.execute("""select * from employees join offices using(officeCode) 
where city = 'Boston';""")
#cur.fetchmany(2)

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [18]:
#Your code here
cur.execute("""SELECT city, count(lastname) FROM employees join offices 
            using(officeCode) GROUP BY 1 ;""")
cur.fetchall()

[('Boston', 2),
 ('London', 2),
 ('NYC', 2),
 ('Paris', 5),
 ('San Francisco', 6),
 ('Sydney', 4),
 ('Tokyo', 2)]

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [28]:
# Your code here
cur.execute("""SELECT lastname, productName 
FROM employees e JOIN customers c 
ON e.employeeNumber = c.salesRepEmployeeNumber
JOIN orders o using(customernumber)
JOIN orderdetails od using(ordernumber)
JOIN products p using (productCode)""")

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head(10)

   lastName                                  productName
0  Jennings                               1958 Setra Bus
1  Jennings                       1940 Ford Pickup Truck
2  Jennings                      1939 Cadillac Limousine
3  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Jennings                            1968 Ford Mustang
5  Jennings                           1968 Dodge Charger
6  Jennings                      1970 Plymouth Hemi Cuda
7  Jennings                           1969 Dodge Charger
8  Jennings                  1948 Porsche 356-A Roadster
9  Jennings                         1969 Dodge Super Bee

## Level Up: Display the Number of Products each employee has sold

In [30]:
#Your code here
df.groupby("productName").count()
df.head(5)

   lastName                                  productName
0  Jennings                               1958 Setra Bus
1  Jennings                       1940 Ford Pickup Truck
2  Jennings                      1939 Cadillac Limousine
3  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Jennings                            1968 Ford Mustang

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!